<?php
/* ====Распечатка массива==== */
function print_arr($arr){
    echo "<pre>";
    print_r($arr);
    echo "</pre>";
}
/* ====Распечатка массива==== */

/* ====Фильтрация входящих данных==== */
function clear($var){
    // mysql_real_escape_string — Экранирует специальные символы в строках для использования в выражениях SQL
    // strip_tags — Удаляет HTML и PHP-теги из строки
    // trim — Удаляет пробелы (или другие символы) из начала и конца строки
    $var = mysql_real_escape_string(strip_tags(trim($var)));
    return $var;
}
/* ====Фильтрация входящих данных==== */

/* ====Редирект ==== */
function redirect(){
    $redirect = isset($_SERVER['HTTP_REFERER']) ? $_SERVER['HTTP_REFERER'] : PATH;
    header("Location: $redirect");
    exit;
}
/* ====Редирект ==== */

/* ===== проверить авторизовался ли пользователь для работы с системой ===== */
function verifying_access(){
    // если пользователя нет в системе или ему закрыт доступ или он ещё не пробовал авторизоваться, то перенаправляем на страницу авторизации
    // в системе работать нельзя
    if($_SESSION['auth']['access_id'] == -1 or $_SESSION['auth']['access_id'] == 0 or empty($_SESSION['auth']['access_id'])){
        header("location: ?view=auth");
        $_SESSION['message'] = "<div class='alert alert-danger' style='margin-top: 10px;'>Доступ закрыт. Авторизуйтесь для работы в системе.</div>";
        exit;
    }
}

/* ===== проверить авторизовался ли пользователь для работы с системой ===== */

/* ===Перевести русское слово в транслит=== */
function rus_to_eng($string) {
    $converter = array(
        'а' => 'a',   'б' => 'b',   'в' => 'v',
        'г' => 'g',   'д' => 'd',   'е' => 'e',
        'ё' => 'e',   'ж' => 'zh',  'з' => 'z',
        'и' => 'i',   'й' => 'y',   'к' => 'k',
        'л' => 'l',   'м' => 'm',   'н' => 'n',
        'о' => 'o',   'п' => 'p',   'р' => 'r',
        'с' => 's',   'т' => 't',   'у' => 'u',
        'ф' => 'f',   'х' => 'h',   'ц' => 'c',
        'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
        'ь' => "'",  'ы' => 'y',   'ъ' => "'",
        'э' => 'e',   'ю' => 'yu',  'я' => 'ya',

        'А' => 'A',   'Б' => 'B',   'В' => 'V',
        'Г' => 'G',   'Д' => 'D',   'Е' => 'E',
        'Ё' => 'E',   'Ж' => 'Zh',  'З' => 'Z',
        'И' => 'I',   'Й' => 'Y',   'К' => 'K',
        'Л' => 'L',   'М' => 'M',   'Н' => 'N',
        'О' => 'O',   'П' => 'P',   'Р' => 'R',
        'С' => 'S',   'Т' => 'T',   'У' => 'U',
        'Ф' => 'F',   'Х' => 'H',   'Ц' => 'C',
        'Ч' => 'Ch',  'Ш' => 'Sh',  'Щ' => 'Sch',
        'Ь' => "'",  'Ы' => 'Y',   'Ъ' => "'",
        'Э' => 'E',   'Ю' => 'Yu',  'Я' => 'Ya',

        ' ' => '_',
    );
    return strtr($string, $converter);
}
/* ===Перевести русское слово в транслит=== */

?>
